Update client, Update README, Update package manifest to repo urls, now public
